Repository: mutse/chibot
Catalog: lib/l10n/app_*.arb
Languages: de, fr, ja, zh_tw

source: Settings
de: Einstellungen
fr: Paramètres
ja: 設定
zh_tw: 設定

source: Select Model Provider:
de: Modellanbieter auswählen:
fr: Sélectionner le fournisseur de modèle :
ja: モデルプロバイダーを選択:
zh_tw: 選擇模型提供者：

source: Add
de: Hinzufügen
fr: Ajouter
ja: 追加
zh_tw: 新增

source: Model Provider URL (Optional):
de: Modellanbieter-URL (optional):
fr: URL du fournisseur de modèle (optionnel) :
ja: モデルプロバイダーURL（オプション）:
zh_tw: 模型提供者網址（可選）：

source: Default: {url}
de: Standard: {url}
fr: Par défaut : {url}
ja: デフォルト: {url}
zh_tw: 預設：{url}

# apiKey
source: {provider} API Key:
de: {provider} API-Schlüssel:
fr: Clé API {provider} :
ja: {provider} APIキー:
zh_tw: {provider} API 金鑰：

source: Enter your API Key
de: Geben Sie Ihren API-Schlüssel ein
fr: Entrez votre clé API
ja: APIキーを入力してください
zh_tw: 請輸入您的 API 金鑰

source: Select Model:
de: Modell auswählen:
fr: Sélectionner le modèle :
ja: モデルを選択:
zh_tw: 選擇模型：

# noModelsAvailable
source: No models available for this provider
de: Keine Modelle für diesen Anbieter verfügbar
fr: Aucun modèle disponible pour ce fournisseur
ja: このプロバイダーで利用可能なモデルがありません
zh_tw: 此提供者沒有可用模型

source: Custom Models:
de: Benutzerdefinierte Modelle:
fr: Modèles personnalisés :
ja: カスタムモデル:
zh_tw: 自訂模型：

source: Enter custom model name
de: Benutzerdefinierten Modellnamen eingeben
fr: Entrez le nom du modèle personnalisé
ja: カスタムモデル名を入力
zh_tw: 輸入自訂模型名稱

source: Your Custom Models:
de: Ihre benutzerdefinierten Modelle:
fr: Vos modèles personnalisés :
ja: あなたのカスタムモデル:
zh_tw: 您的自訂模型：

source: Save Settings
de: Einstellungen speichern
fr: Enregistrer les paramètres
ja: 設定を保存
zh_tw: 儲存設定

source: Settings saved!
de: Einstellungen gespeichert!
fr: Paramètres enregistrés !
ja: 設定が保存されました！
zh_tw: 設定已儲存！

source: Select Model Type:
de: Modelltyp auswählen:
fr: Sélectionner le type de modèle :
ja: モデルタイプを選択:
zh_tw: 選擇模型類型：

source: Text Model
de: Textmodell
fr: Modèle de texte
ja: テキストモデル
zh_tw: 文字模型

source: Image Model
de: Bildmodell
fr: Modèle d'image
ja: 画像モデル
zh_tw: 圖像模型

source: Add New Model Configuration
de: Neue Modellkonfiguration hinzufügen
fr: Ajouter une nouvelle configuration de modèle
ja: 新しいモデル設定を追加
zh_tw: 新增模型配置

source: Model Provider
de: Modellanbieter
fr: Fournisseur de modèle
ja: モデルプロバイダー
zh_tw: 模型提供者

source: Enter Provider Name
de: Anbietername eingeben
fr: Entrez le nom du fournisseur
ja: プロバイダー名を入力
zh_tw: 輸入提供者名稱

# enterModelNames
source: Enter model names (comma-separated)
de: Modellnamen eingeben (durch Kommas getrennt)
fr: Entrez les noms des modèles (séparés par des virgules)
ja: モデル名を入力（カンマ区切り）
zh_tw: 輸入模型名稱（以逗號分隔）

source: Cancel
de: Abbrechen
fr: Annuler
ja: キャンセル
zh_tw: 取消

source: Chat with AI
de: Mit KI chatten
fr: Discuter avec l'IA
ja: AIとチャット
zh_tw: 與 AI 對話

source: Type your message...
de: Geben Sie Ihre Nachricht ein...
fr: Tapez votre message...
ja: メッセージを入力...
zh_tw: 輸入您的訊息...

source: Custom
de: Benutzerdefiniert
fr: Personnalisé
ja: カスタム
zh_tw: 自訂

# apiKeyNotSetError
source: API Key not set. Please set it in settings.
de: API-Schlüssel nicht gesetzt. Bitte in den Einstellungen festlegen.
fr: Clé API non définie. Veuillez la définir dans les paramètres.
ja: APIキーが設定されていません。設定で設定してください。
zh_tw: 未設定 API 金鑰。請在設定中進行設定。

source: Search
de: Suchen
fr: Rechercher
ja: 検索
zh_tw: 搜尋

source: About
de: Über
fr: À propos
ja: について
zh_tw: 關於

# chatGPTTitle
source: Chibot Title
de: Chibot Titel
fr: Titre Chibot
ja: Chibotタイトル
zh_tw: Chibot 標題

source: AI is Thinking
de: KI denkt nach
fr: L'IA réfléchit
ja: AIが考えています
zh_tw: AI 正在思考

source: Ask Any Question
de: Stellen Sie eine beliebige Frage
fr: Posez n'importe quelle question
ja: 何でも質問してください
zh_tw: 詢問任何問題

source: Add Model Provider
de: Modellanbieter hinzufügen
fr: Ajouter un fournisseur de modèle
ja: モデルプロバイダーを追加
zh_tw: 新增模型提供者

source: Provider Name Hint
de: Anbieter-Name-Hinweis
fr: Indication du nom du fournisseur
ja: プロバイダー名ヒント
zh_tw: 提供者名稱提示

source: Models Hint
de: Modell-Hinweis
fr: Indication des modèles
ja: モデルヒント
zh_tw: 模型提示

# appTitle
source: Chi AI Chatbot
ja: Chi AI チャットボット
zh_tw: Chi AI 聊天機器人

# noResponseFromAI
source: AI did not return a response.
de: KI hat keine Antwort zurückgegeben.
fr: L'IA n'a pas retourné de réponse.
ja: AIからの応答がありませんでした。
zh_tw: AI 沒有回應。

# pleaseEnterPromptAfterImagine
source: Please enter a prompt after /imagine.
de: Bitte geben Sie eine Eingabe nach /imagine ein.
fr: Veuillez entrer une invite après /imagine.
ja: /imagineの後にプロンプトを入力してください。
zh_tw: 請在 /imagine 後輸入提示詞。

# failedToGenerateImageNoUrl
source: Failed to generate image: No image URL returned.
de: Fehler beim Generieren des Bildes: Keine Bild-URL zurückgegeben.
fr: Échec de la génération d'image : Aucune URL d'image retournée.
ja: 画像の生成に失敗しました: 画像URLが返されませんでした。
zh_tw: 圖像生成失敗：未返回圖像網址。

source: Error loading image.
de: Fehler beim Laden des Bildes.
fr: Erreur lors du chargement de l'image.
ja: 画像の読み込みエラー。
zh_tw: 圖像載入錯誤。

source: No image generated.
de: Kein Bild generiert.
fr: Aucune image générée.
ja: 画像が生成されませんでした。
zh_tw: 未生成圖像。

# errorGeneratingImage
source: Error generating image: {error}
de: Fehler beim Generieren des Bildes: {error}
fr: Erreur lors de la génération d'image : {error}
ja: 画像生成エラー: {error}
zh_tw: 圖像生成錯誤：{error}

source: Save image
de: Bild speichern
fr: Enregistrer l'image
ja: 画像を保存
zh_tw: 儲存圖像

source: Image Generation Settings
de: Bildgenerierungseinstellungen
fr: Paramètres de génération d'image
ja: 画像生成設定
zh_tw: 圖像生成設定

source: Select Image Provider:
de: Bildanbieter auswählen:
fr: Sélectionner le fournisseur d'image :
ja: 画像プロバイダーを選択:
zh_tw: 選擇圖像提供者：

source: Image Provider URL (Optional):
de: Bildanbieter-URL (optional):
fr: URL du fournisseur d'image (optionnel) :
ja: 画像プロバイダーURL（オプション）:
zh_tw: 圖像提供者網址（可選）：

source: Enter image provider URL
de: Bildanbieter-URL eingeben
fr: Entrez l'URL du fournisseur d'image
ja: 画像プロバイダーURLを入力
zh_tw: 輸入圖像提供者網址

source: Select Image Model:
de: Bildmodell auswählen:
fr: Sélectionner le modèle d'image :
ja: 画像モデルを選択:
zh_tw: 選擇圖像模型：

source: Custom Image Models:
de: Benutzerdefinierte Bildmodelle:
fr: Modèles d'image personnalisés :
ja: カスタム画像モデル:
zh_tw: 自訂圖像模型：

source: Enter custom image model name
de: Benutzerdefinierten Bildmodellnamen eingeben
fr: Entrez le nom du modèle d'image personnalisé
ja: カスタム画像モデル名を入力
zh_tw: 輸入自訂圖像模型名稱

source: Provider and model added!
de: Anbieter und Modell hinzugefügt!
fr: Fournisseur et modèle ajoutés !
ja: プロバイダーとモデルが追加されました！
zh_tw: 提供者和模型已新增！

# providerAndModelNameCannotBeEmpty
source: Provider name and model name cannot be empty.
de: Anbietername und Modellname dürfen nicht leer sein.
fr: Le nom du fournisseur et du modèle ne peuvent pas être vides.
ja: プロバイダー名とモデル名は空にできません。
zh_tw: 提供者名稱和模型名稱不能為空。

source: New Chat
de: Neuer Chat
fr: Nouveau chat
ja: 新しいチャット
zh_tw: 新聊天

source: Image generated successfully!
de: Bild erfolgreich generiert!
fr: Image générée avec succès !
ja: 画像が正常に生成されました！
zh_tw: 圖像生成成功！

source: New Image Session
de: Neue Bildsitzung
fr: Nouvelle session d'image
ja: 新しい画像セッション
zh_tw: 新圖像工作階段

# appDesc
source: Smart Chat Assistant
de: Intelligenter Chat-Assistent
fr: Assistant de chat intelligent
ja: スマートチャットアシスタント
zh_tw: 智能聊天助手

# version
source: Version v1.0.0
de: Version v0.1.3
fr: Version v0.1.3
ja: バージョン v0.1.3
zh_tw: 版本 v0.1.3

# releaseDate
source: June 2025
de: Juli 2025
fr: Juillet 2025
ja: 2025年7月
zh_tw: 2025年7月

# featureSmartChat
source: Smart Chat
de: Intelligenter Chat
fr: Chat intelligent
ja: スマートチャット
zh_tw: 智能對話

# featureSmartDesc
source: Supports multiple AI models for natural conversations.
de: Unterstützt mehrere KI-Modelle für natürliche Gespräche.
fr: Prend en charge plusieurs modèles d'IA pour des conversations naturelles.
ja: 自然な会話のための複数のAIモデルをサポート。
zh_tw: 支援多種 AI 模型進行自然對話。

source: Features
de: Funktionen
fr: Fonctionnalités
ja: 機能
zh_tw: 功能

# featureImageGen
source: Text-to-Image
de: Text zu Bild
fr: Texte vers image
ja: テキストから画像
zh_tw: 文字轉圖像

# featureImageGenDesc
source: Generate beautiful images from text prompts.
de: Generieren Sie schöne Bilder aus Texteingaben.
fr: Générez de belles images à partir d'invites textuelles.
ja: テキストプロンプトから美しい画像を生成。
zh_tw: 從文字提示生成美麗的圖像。

# featureFlexible
source: Flexible Configuration
de: Flexible Konfiguration
fr: Configuration flexible
ja: 柔軟な設定
zh_tw: 彈性配置

# featureFlexibleDesc
source: Supports multiple model providers and custom settings.
de: Unterstützt mehrere Modellanbieter und benutzerdefinierte Einstellungen.
fr: Prend en charge plusieurs fournisseurs de modèles et paramètres personnalisés.
ja: 複数のモデルプロバイダーとカスタム設定をサポート。
zh_tw: 支援多種模型提供者和自訂設定。
